#====================================================================
set(QT_VERSION      6 ) # Задаём используемую версию Qt
#====================================================================
# Автоматизируем Qt сборку
set(CMAKE_AUTOMOC   ON) # Автоматическая компиляция MOC
set(CMAKE_AUTORCC   ON) # Автоматическая обработка ресурсов
set(CMAKE_AUTOUIC   ON) # Автоматическая обработка UI
#====================================================================
# Ищим используемые библиотеки
find_package(Qt${QT_VERSION} COMPONENTS Core Network REQUIRED) # Ищим библиотеки QT
#====================================================================
